archiveLog/tr/HtmlKituraClientWrk2V1bc.txt
Running 15s test @ http://169.254.90.222:8282/jsonShortKitura
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.922ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.888ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.41ms  647.45us   4.36ms   67.35%
    Req/Sec    55.59     87.12   333.00     78.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.34ms
 75.000%    2.88ms
 90.000%    3.27ms
 99.000%    3.80ms
 99.900%    4.37ms
 99.990%    4.37ms
 99.999%    4.37ms
100.000%    4.37ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.767     0.000000            1         1.00
       1.644     0.100000           49         1.11
       1.817     0.200000           98         1.25
       1.989     0.300000          147         1.43
       2.197     0.400000          196         1.67
       2.341     0.500000          245         2.00
       2.455     0.550000          270         2.22
       2.605     0.600000          294         2.50
       2.719     0.650000          319         2.86
       2.803     0.700000          345         3.33
       2.881     0.750000          368         4.00
       2.933     0.775000          380         4.44
       3.005     0.800000          392         5.00
       3.057     0.825000          405         5.71
       3.135     0.850000          417         6.67
       3.185     0.875000          429         8.00
       3.221     0.887500          435         8.89
       3.269     0.900000          441        10.00
       3.335     0.912500          448        11.43
       3.387     0.925000          454        13.33
       3.473     0.937500          460        16.00
       3.489     0.943750          463        17.78
       3.517     0.950000          466        20.00
       3.563     0.956250          469        22.86
       3.599     0.962500          472        26.67
       3.637     0.968750          475        32.00
       3.647     0.971875          477        35.56
       3.649     0.975000          478        40.00
       3.669     0.978125          480        45.71
       3.703     0.981250          481        53.33
       3.731     0.984375          483        64.00
       3.791     0.985938          484        71.11
       3.791     0.987500          484        80.00
       3.797     0.989062          485        91.43
       3.827     0.990625          486       106.67
       3.869     0.992188          487       128.00
       3.869     0.992969          487       142.22
       3.869     0.993750          487       160.00
       3.963     0.994531          488       182.86
       3.963     0.995313          488       213.33
       3.983     0.996094          489       256.00
       3.983     0.996484          489       284.44
       3.983     0.996875          489       320.00
       3.983     0.997266          489       365.71
       3.983     0.997656          489       426.67
       4.367     0.998047          490       512.00
       4.367     1.000000          490          inf
#[Mean    =        2.412, StdDeviation   =        0.647]
#[Max     =        4.364, Total count    =          490]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1502 requests in 15.00s, 322.24KB read
Requests/sec:    100.11
Transfer/sec:     21.48KB